artifact/jobs/FSIAJ001-01-ES/datas/trade/output/declaration.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:dec="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ddii/enol/ws/Declaracion.xsd"
                  xmlns:dec1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ddii/enol/ws/DeclaracionInformativa.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <dec:Declaracion>
            <?xml version='1.0' encoding='UTF-8'?>
            <cabecera>
                <communicationType>A0</communicationType>
                <model>172</model>
                <fiscalYear>2023</fiscalYear>
                <modelVersionId>1.0</modelVersionId>
                <declarant>
                    <taxId>A48265169</taxId>
                    <companyName>BANCO BILBAO VIZCAYA ARGENTARIA S.A.</companyName>
                    <representativeTaxId>XXXXXXXX</representativeTaxId>
                    <contactPerson>
                        <phone>+34987654321</phone>
                        <fullName>John Doe</fullName>
                    </contactPerson>
                </declarant>
            </cabecera>
            <declaredEntities class="singleton-list">
                <dec1:Declarado>
                    <declaredRecordId>123456</declaredRecordId>
                    <key>T</key>
                    <fullName>John Doe, Jane Smith</fullName>
                    <address>
                        <country>ES</country>
                        <city>Madrid</city>
                        <street>Gran Via</street>
                        <number>12</number>
                        <postalCode>28013</postalCode>
                    </address>
                    <dec1:IDMonedas>
                        <currencyType>V</currencyType>
                        <currencyName>BTC/EUR</currencyName>
                        <currencySymbol>BTC</currencySymbol>
                        <numberOfUnits>2</numberOfUnits>
                        <currencyValue>34950.5</currencyValue>
                        <valueSource>CoinMarketCap</valueSource>
                        <custodyEndDate class="sql-date">2024-01-30</custodyEndDate>
                        <balanceAtYearEnd>87450.38</balanceAtYearEnd>
                    </dec1:IDMonedas>
                </dec1:Declarado>
            </declaredEntities>
        </dec:Declaracion>
    </soapenv:Body>
</soapenv:Envelope>